# Найдите сумму цифр трехзначного числа n.
# Результат сохраните в перменную res.

# Пример:
# n = 123 -> res = 6 (1 + 2 + 3)
# n = 100 -> res = 1 (1 + 0 + 0)
 
n = 567
res = (n // 100) + ((n // 10) % 10) + (n % 10)
print(res) # выводит 18 (5 + 6 + 7)


# python
# Бумажные журавлики
# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали n журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.

# Пример:
# n = 6 -> 1 4 1  
# n = 24 -> 4 16 4    
# n = 60 -> 10 40 10

n = int(input()) # считываем количество журавликов

# Петя и Сережа сделали одинаковое количество журавликов
# пусть это количество будет x
# тогда количество журавликов, сделанных Катей, будет 2*x

x = n // 6 # находим общее количество журавликов, которое сделали Петя и Сережа
# делим на 6, потому что всего у нас 3 ребенка и каждый делает по 2 журавлика (всего 6)

print(x, 2*x, x) # выводим результаты: Петя и Сережа сделали x журавликов, Катя - 2*x, Петя - x

# Счастливый билет
# Инструкция по использованию платформы
# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета с номером n и выводит на экран yes или no.

# Пример:
# n = 385916 -> yes
# n = 123456 -> no

n = input() # считываем номер билета как строку

# находим суммы первых и последних трех цифр
sum1 = int(n[0]) + int(n[1]) + int(n[2])
sum2 = int(n[3]) + int(n[4]) + int(n[5])

if sum1 == sum2:
    print("yes")
else:
    print("no")

# Деление шоколадки
# Инструкция по использованию платформы
# Определите, можно ли от шоколадки размером a × b долек отломить c долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
# Выведите yes или no соответственно.

# Пример:
# a, b, c = 3, 2, 4 -> yes
# a, b, c = 3, 2, 1 -> no

a, b, c = map(int, input().split()) # считываем размеры шоколадки и количество долек для отлома
if c <= a*b and (c % a == 0 or c % b == 0):
    print("yes")
else:
    print("no")